# Мальчик Петя строит из кубиков лестницу.
# Лестница представляет собой несколько строящихся рядом башенок из кубиков,
# каждая из которых ровно на один кубик выше предыдущей.
# Требуется по имеющемуся у мальчика Пети числу кубиков определить,
# какой в кубиках будет высота последней ступеньки.
# Входной файл содержит число К – количество кубиков у мальчика Пети (1 ≤ K ≤ 106).
# В выходной файл выведите количество кубиков в последней ступеньке у максимально высокой лестницы,
# которую можно построить из K кубиков.


k = int(input())
i = 0
used = 0
answer = 0

for i in range(1, k + 1):
    if ...:
        used = ...
        answer = ...
    else:
        break

    print(answer)
